'''names = [
    ["曹操", "56", "男", "106", "IBM", 500, "50"],
    ["大乔", "19", "女", "230", "微软", 501, "60"],
    ["小乔", "19", "女", "210", "Oracle", 600, "60"],
    ["许褚", "45", "男", "230", "Tencent", 700, "10"]]
names.insert(4, ["刘备", "45", "男", "220", "alibaba", 500, "30"])
d1, d2, d3, d5, d7 = 0, 0, 0, 0, 0
d4 = input('请输入要统计的性别')
d6 = input('请输入要统计的部门')
while d1 < len(names):
    d2 = d2 + names[d1][5]
    d3 = d3 + int(names[d1][1])
    d5 = d5 + names[d1][3].count(d4)
    d7 = d7 + names[d1][6].count(d6)
    d1 += 1
print('平均薪资为', d2 / 4)
print('平均年龄为', d3 / 4)
print('%s性有%d人' % (d4, d5))
print('%s部门有%d人' % (d6, d7))'''#人员数据库，请按要求实现

'''l = [56 ,19 ,19,45 ]
a=sum(l)/len(l)

print("avge is:", round(a,2) )'''#每个人的平均年龄

'''num = int(input('请输入一个数：'))
while num != 0:
    print(num % 10)
    num = num // 10'''#输入54321的程序

'''f = [5, 2, 4, 7, 9, 1, 3, 5, 4, 0, 6, 1, 3]'''#请对下列列表进行冒泡排序





